In [254]:
#Naive Bayes Example

#Predict/classify if a titanic passenger will survive or not
#Each datapoint is a passenger 


#Import Libraries and data
import pandas as pd

df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [255]:
#Drop useless columns and cleanup data

df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [256]:
inputs = df.drop('Survived', axis='columns')
target = df.Survived 

#Convert strings to dummy integers

dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [257]:
inputs = pd.concat([inputs,dummies], axis='columns').drop('Sex', axis='columns')
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [258]:
#Check for any null values
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [259]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [260]:
#Find NaN values and replace with average ages 

inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

In [261]:
#Split Data 

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [262]:
#Use Gaussian Naive Bayes when data is normally distributed

from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train,y_train)

GaussianNB()

In [263]:
model.score(X_test,y_test)

0.753731343283582

In [264]:
model.predict(X_test[0:10])
model.predict_proba(X_test[:10])

array([[0.98304153, 0.01695847],
       [0.01151653, 0.98848347],
       [0.05916744, 0.94083256],
       [0.05991424, 0.94008576],
       [0.98600012, 0.01399988],
       [0.98324253, 0.01675747],
       [0.99149625, 0.00850375],
       [0.98241875, 0.01758125],
       [0.99320037, 0.00679963],
       [0.98285953, 0.01714047]])

In [265]:
#Calculate the cross validation score
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.704     , 0.816     , 0.84      , 0.78225806, 0.82258065])